In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago'],
    'Salary': [50000, 60000, 45000, 70000]
}

df = pd.DataFrame(data)
df

      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   22    Los Angeles   45000
3    David   35        Chicago   70000

<b>Use iloc to select the following:</b>

a. The second row of the DataFrame.<br>

b. The third column of the DataFrame.<br>

c. The value in the second row and third column.

In [2]:
df.iloc[2:3,:]

      Name  Age         City  Salary
2  Charlie   22  Los Angeles   45000

In [7]:
df.iloc[:,3:]

   Salary
0   50000
1   60000
2   45000
3   70000

In [8]:
df.iloc[2:3,3:]

   Salary
2   45000

<b>Selecting Rows and Columns with loc</b>

Consider the same DataFrame as in Problem 1. Now, use loc to select the following:

a. The row with the Name 'Bob'.<br>

b. The 'City' and 'Salary' columns for the person with the Name 'Charlie'.<br>

c. The Age of the person with the highest Salary.

In [26]:
df.loc[1:1,:]

  Name  Age           City  Salary
1  Bob   30  San Francisco   60000

In [27]:
df.loc[2:2,'City':'Salary']

          City  Salary
2  Los Angeles   45000

In [29]:
sal = df.Salary.max()

In [32]:
df[df['Salary']==sal].iloc[:,1:2]

   Age
3   35

In [33]:
df.loc[df['Name']=='Bob']

  Name  Age           City  Salary
1  Bob   30  San Francisco   60000

In [35]:
df.loc[df['Salary']==sal].Age

3    35
Name: Age, dtype: int64

In [38]:
df.loc[df['Name']== 'Charlie','City':'Salary']

          City  Salary
2  Los Angeles   45000

In [43]:
df.iloc[[1,3],[1,3]]

   Age  Salary
1   30   60000
3   35   70000

<b> Filtering Data with loc </b>

Using the DataFrame from Problem 1, use loc to filter the data:<br>

a. Select all rows where the Age is greater than 25.<br>

b. Select all rows where the City is 'San Francisco' and the Salary is less than 70000.

In [44]:
df.loc[df.Age>25]

    Name  Age           City  Salary
1    Bob   30  San Francisco   60000
3  David   35        Chicago   70000

In [45]:
df[df.Age>25]

    Name  Age           City  Salary
1    Bob   30  San Francisco   60000
3  David   35        Chicago   70000

In [47]:
df.loc[(df['City']=='San Francisco') & (df['Salary']<70000)]

  Name  Age           City  Salary
1  Bob   30  San Francisco   60000

In [48]:
import pandas as pd

data = {
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12]
}

df = pd.DataFrame(data)
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

a. Use iloc to change the value in the second row and third column to 99.<br>

b. Use loc to set the value in the row where column 'A' is 3 and column 'B' is 7 to 0.

In [60]:
df.iloc[1:2,2:]=99
df

   A  B   C
0  1  5   9
1  2  6  99
2  3  7  11
3  4  8  12

In [62]:
df.loc[df.A==3,['A','B']]=0
df

   A  B   C
0  1  5   9
1  2  6  99
2  0  0  11
3  4  8  12

In [63]:
import pandas as pd

data = {
    'Country': ['USA', 'Canada', 'Germany', 'France', 'Japan'],
    'Population (Millions)': [331, 38, 83, 67, 126],
    'GDP (Trillions)': [21.43, 1.84, 4.42, 2.78, 5.08],
    'Area (Square KM)': [9833517, 9976140, 357022, 551695, 377975],
    'Happiness Index': [7.2, 7.6, 6.9, 6.5, 6.0]
}

df_countries = pd.DataFrame(data)
df_countries

,Country,Population (Millions),GDP (Trillions),Area (Square KM),Happiness Index
0,USA,331,21.43,9833517,7.2
1,Canada,38,1.84,9976140,7.6
2,Germany,83,4.42,357022,6.9
3,France,67,2.78,551695,6.5
4,Japan,126,5.08,377975,6.0

a. Use iloc to select the first three rows and the last two columns.<br>

b. Use loc to filter the countries with a Happiness Index greater than 7.<br>

c. Use iloc to select the second and fourth rows and all columns.

In [66]:
df_countries.iloc[:3,3:]

   Area (Square KM)  Happiness Index
0           9833517              7.2
1           9976140              7.6
2            357022              6.9

In [70]:
df_countries.loc[df_countries['Happiness Index']>7]

,Country,Population (Millions),GDP (Trillions),Area (Square KM),Happiness Index
0,USA,331,21.43,9833517,7.2
1,Canada,38,1.84,9976140,7.6

In [71]:
df_countries.iloc[[2,4],:]

,Country,Population (Millions),GDP (Trillions),Area (Square KM),Happiness Index
2,Germany,83,4.42,357022,6.9
4,Japan,126,5.08,377975,6.0

In [73]:
import pandas as pd

data = {
    'Subject': ['Math', 'English', 'History', 'Science'],
    'Score_Alice': [85, 90, 78, 92],
    'Score_Bob': [88, 85, 92, 89],
    'Score_Charlie': [75, 80, 85, 88]
}

df_scores = pd.DataFrame(data)
df_scores

   Subject  Score_Alice  Score_Bob  Score_Charlie
0     Math           85         88             75
1  English           90         85             80
2  History           78         92             85
3  Science           92         89             88

a. Use loc to change the score of Alice in History to 80.<br>

b. Use loc to set the scores of Bob in all subjects to 95.

In [76]:
df_scores.loc[df_scores.Subject=='History',['Score_Alice']]= 80
df_scores

   Subject  Score_Alice  Score_Bob  Score_Charlie
0     Math           85         88             75
1  English           90         85             80
2  History           80         92             85
3  Science           92         89             88

In [77]:
df_scores.loc[:,['Score_Bob']]= 95
df_scores

   Subject  Score_Alice  Score_Bob  Score_Charlie
0     Math           85         95             75
1  English           90         95             80
2  History           80         95             85
3  Science           92         95             88

In [78]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago'],
    'Salary': [50000, 60000, 45000, 70000]
}

df_people = pd.DataFrame(data)
df_people

      Name  Age           City  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   22    Los Angeles   45000
3    David   35        Chicago   70000

a. Use loc to select rows where the Age is less than 30.<br>

b. Use loc to select rows where the City is either 'New York' or 'Chicago'.<br>

c. Use loc to select rows where Salary is greater than or equal to 60000 and Age is less than 30.

In [79]:
df_people.loc[df_people.Age<30]

      Name  Age         City  Salary
0    Alice   25     New York   50000
2  Charlie   22  Los Angeles   45000

In [82]:
df_people.loc[(df_people.City == 'New York') |( df_people.City == 'Chicago')]

    Name  Age      City  Salary
0  Alice   25  New York   50000
3  David   35   Chicago   70000

In [86]:
df_people.loc[(df_people.Salary>=60000) & (df_people.Age<=30)]

  Name  Age           City  Salary
1  Bob   30  San Francisco   60000